Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གསུམ་པའོ།
en: The sixty-third is, “How the perfection of perseverance?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་བཞི་པའོ།
en: The sixty-fourth is, “How the perfection of concentration?”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེ་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་ཡང་དག་པར་ཞུགས་པ་ལགས་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་ལྔ་པའོ།
en: The sixty-fifth is, “How long a time has it been since bodhisattva great beings with such skillful means set out?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེས་སངས་རྒྱས་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བགྱིས་པ་ལགས་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་དྲུག་པའོ།
en: The sixty-sixth is, “Lord, how many lord buddhas have the bodhisattva great beings with such skillful means attended on?”

source: །དགེ་བའི་རྩ་བ་ཇི་ཙམ་ཞིག་བསྐྱེད་པ་ལགས་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་བདུན་པའོ།
en: The sixty-seventh is, “How large is the wholesome root they have planted?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་བརྒྱད་པའོ།
en: The sixty-eighth is, “Lord, if all phenomena are empty of an intrinsic nature how will bodhisattva great beings practicing the perfection of giving and so on fully awaken?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དོན་གྱི་རྗེས་སུ་ཞུགས་པའི་ཆོས་གང་ཡང་བྱེ་བྲག་གམ་ཐ་དད་དུ་བགྱི་བ་མ་མཆིས་ན། ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་གི་རབ་ཅེས་བྱ་བ་ནི་དྲུག་ཅུ་དགུ་པའོ།
en: The sixty-ninth is, “Lord, given there is no specific feature or variation of any phenomenon for someone who has entered into reality, why is the perfection of wisdom said to be the highest… when it comes to the five perfections?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆོས་གང་ཡང་ཡོངས་སུ་འཛིན་པའམ་གཏོང་བ་མ་མཆིས་སམ་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་པའོ།
en: The seventieth is, “Lord, does the perfection of wisdom not fully take hold of or release any dharma?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་གཟུགས་ཡོངས་སུ་མ་བཟུང་མ་བཏང་བ་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གཅིག་པའོ།
en: The seventy-first is, “Lord, how is form not taken hold of and not released?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཟུགས་ཡིད་ལ་མི་བགྱི་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གཉིས་པའོ།
en: The seventy-second is, “Lord, if there is no attention being paid to form, how will the wholesome roots flourish?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་འདི་ལྟར་གཟུགས་ཡིད་ལ་མི་བགྱི་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གསུམ་པའོ།
en: The seventy-third is, “Lord, why, when they thus do not pay attention to form, do they reach the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་གང་ལ་གནས་པར་མི་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་བཞི་པའོ།
en: The seventy-fourth is, “Lord, where will bodhisattva great beings practicing the perfection of wisdom stand?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ལ་གནས་པར་མི་འགྱུར་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་ལྔ་པའོ།
en: The seventy-fifth is, “Lord, how will they not stand in form?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྐྱོན་འདི་དག་མ་མཆིས་པར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་དྲུག་པའོ།
en: The seventy-sixth is, “Lord, how will these faults of bodhisattva great beings practicing the perfection of wisdom not occur?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ལགས་སམ་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་བདུན་པའོ།
en: The seventy-seventh is, “Lord, is the perfection of wisdom not separated from the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་ནི་གང་ལགས་ལམ་མ་ལགས་པ་ནི་གང་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་བརྒྱད་པའོ།
en: The seventy-eighth is, “Lord, what is the path of bodhisattva great beings, and what is not the path?”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ཇི་ལྟར་སྦྱིན་པ་སྦྱིན་པར་བགྱི་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་དགུ་པའོ།
en: The seventy-ninth is, “Lord, if the perfection of wisdom does not produce and does not stop any phenomenon, how do bodhisattva great beings practicing the perfection of wisdom give gifts?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པར་བགྱི་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་པའོ།
en: The eightieth is, “Lord, how should bodhisattva great beings make an effort at the six perfections?”

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་གསུངས་པ་ལགས་སམ་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་གཅིག་པའོ།
en: The eighty-first is, “Lord, have you said that they have to train in the perfection of wisdom with the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་ཅེས་བྱ་བ་ནི་བརྒྱད་ཅུ་གཉིས་པའོ།
en: The eighty-second is, “Lord, how do the lord buddhas watch over those practicing the perfection of giving?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་མདོ་དང་རྒྱས་པ་འཚལ་བར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་གསུམ་པའོ།
en: The eighty-third is, “Lord, how will bodhisattva great beings come to know all dharmas in brief and in detail?”

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་བཞི་པའོ།
en: The eighty-fourth is, “Lord, what is the suchness of form?”

source: །བཅོམ་ལྡན་འདས་ཡང་དག་པའི་མཐའ་དེ་གང་ལགས་ཞེས་བགྱི་བ་ནི་བརྒྱད་ཅུ་ལྔ་པའོ།
en: The eighty-fifth is, “Lord, what is the very limit of reality?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་མདོ་དང་རྒྱས་པ་འཚལ་བར་བགྱི་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་དྲུག་པའོ།
en: The eighty-sixth is, “Lord, how should all dharmas be known in brief and in detail?”

source: །བཅོམ་ལྡན་འདས་ཆོས་གང་དག་ལྡན་པ་ཡང་མ་ལགས་མི་ལྡན་པ་ཡང་མ་ལགས་པའི་ཆོས་དེ་དག་ཀྱང་གང་ལགས་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་བདུན་པའོ།
en: The eighty-seventh is, “Lord, what are the dharmas that are not conjoined and are not disjoined?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བགྱི་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་བརྒྱད་པའོ།
en: The eighty-eighth is, “Lord, how should bodhisattva great beings practice the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ཏུ་སྤྱད་ན་ཞེས་བྱ་བ་ནི་བརྒྱད་ཅུ་དགུ་པའོ།
en: The eighty-ninth is, “Lord, for bodhisattva great beings practicing the perfection of wisdom, how long is it?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་སེམས་ཀྱི་རྒྱུན་མ་ཆད་པ་དང་མ་བྲལ་བར་རྗེས་སུ་འབྲེལ་བས་སྤྱད་པར་བགྱི་འམ་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་པའོ།
en: The ninetieth is, “Lord, should they practice connected with an unbroken, unseparated thought?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་གཅིག་པའོ།
en: The ninety-first is, “Lord, will bodhisattva great beings who have practiced the perfection of wisdom, accomplished the perfection of wisdom, and meditated on the perfection of wisdom reach the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་སྐབས་འདིར་བར་སྐབས་སུ་ཞུས་པའི་རྣམ་པ་བཞིའོ།
en: In this “Lord, how will bodhisattvas reach the knowledge of all aspects?” part of the text, there are four questions in a subsection.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གདགས་སུ་མ་མཆིས་པ་ལགས་སམ་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་གཉིས་པའོ།
en: The ninety-second is, “Lord, is the perfection of wisdom something that cannot be labeled?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སེམས་ཅན་དམྱལ་བ་གདགས་སུ་མ་མཆིས་པར་གྱུར་ཅེས་བྱ་བ་ནི་དགུ་བཅུ་གསུམ་པའོ།
en: The ninety-third is, “Why, Lord, does hell have a label?”

source: །བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་བཞི་པའོ།
en: The ninety-fourth is, “Well then, Lord, do bodhisattva great beings practicing the perfection of wisdom train in form?”

source: །བཅོམ་ལྡན་འདས་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་ལྔ་པའོ།
en: The ninety-fifth is, “Lord, how should they train in form as not produced and not stopping?”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཇི་ལྟར་བསླབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་དྲུག་པའོ།
en: The ninety-sixth is, “Lord, how should they train in all dharmas empty of their own marks?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་བདུན་པའོ།
en: The ninety-seventh is, “Lord, if form is empty of form, how will bodhisattva great beings practice the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སྤྱོད་པ་མ་མཆིས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་བརྒྱད་པའོ།
en: The ninety-eighth is, “Lord, why is not practicing the practice of the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་སྤྱོད་པ་མ་མཆིས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་དགུ་བཅུ་དགུ་པའོ།
en: The ninety-ninth is, “Lord, if not practicing is the practice of the perfection of wisdom, how then will bodhisattva great beings who are beginning the work practice the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་མི་དམིགས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་བརྒྱ་པའོ།
en: The one hundredth is, “Lord, to what extent does not apprehending come about?”

source: །འདི་མན་ཆད་ནི་བརྒྱ་ཕྲག་གཉིས་པ་ལ་བབ་སྟེ།
en: From here on down are the second hundred.

source: བཅོམ་ལྡན་འདས་གཉིས་ཞེས་བགྱི་བ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་དང་པོའོ།
en: The first is, “Lord, what is duality?”

source: །བཅོམ་ལྡན་འདས་གཉིས་སུ་མ་མཆིས་པ་གང་ལགས་ཞེས་བྱ་བ་ནི་གཉིས་པའོ།
en: The second is, “Lord, what is nonduality?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་དམིགས་སུ་མ་མཆིས་པ་མི་དམིགས་སམ་ཞེས་བྱ་བ་ནི་གསུམ་པའོ།
en: The third is, “Lord, is what cannot be apprehended not apprehended?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་དམིགས་པ་ལ་མི་ཆགས་ཤིང་མི་དམིགས་པ་ལ་ཡང་མི་ཆགས་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་བཞི་པའོ།
en: The fourth is, “Lord, if bodhisattva great beings practicing the perfection of wisdom are not attached to apprehending and are not attached to not apprehending, how, Lord, will bodhisattva great beings practicing the perfection of wisdom complete level after level, and how, having completed level after level, will they reach the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དམིགས་སུ་མ་མཆིས་ཏེ་ཞེས་བྱ་བ་ནི་ལྔ་པའོ།
en: The fifth is, “Lord, if a perfection of wisdom cannot be apprehended, how will bodhisattvas… make an investigation?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་གཟུགས་ཀྱང་མི་དམིགས་ཞེས་བྱ་བ་ནི་དྲུག་པའོ།
en: The sixth is, “Lord, if bodhisattva great beings practicing the perfection of wisdom do not apprehend form, … how will they complete the perfection of giving… and having done the work of a buddha free all beings from saṃsāra?”

source: །བཅོམ་ལྡན་འདས་འོ་ན་སུའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས་ཞེས་བྱ་བ་ནི་བདུན་པའོ།
en: The seventh is, “Well then, Lord, for whose sake do bodhisattva great beings practice the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་མ་བགྱིས་པ་སྟེ། མངོན་པར་འདུས་མ་བགྱིས་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་བརྒྱད་པའོ།
en: The eighth is, “Lord, if all dharmas are unmade and are unchanging, how is there an arrangement of three vehicles?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྤྱན་ལྔས་ཀྱང་ཞེས་པ་ནི་དགུ་པའོ།
en: The ninth is, “Lord, if a tathāgata, worthy one, perfectly complete buddha were not to apprehend with the five eyes those beings they free from saṃsāra, how then would the Lord… have predicted beings in the three groups…?”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་དམ་པ་ལ་བཞུགས་ཏེ་ཞེས་བྱ་བ་ནི་བཅུ་པའོ།
en: The tenth is, “But Lord, the tathāgatas stood in the ultimate and fully awakened to unsurpassed, perfect complete awakening.”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ་ལགས་ན་ཞེས་བྱ་བ་ནི་བཅུ་གཅིག་པའོ།
en: The eleventh is, “Lord, if all dharmas are like magical creations, then what distinction and what differentiation, Lord, is there between a tathāgata and a magical creation?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་དེ་བཞིན་གཤེགས་པ་མི་བཞུགས་ན་ཞེས་བྱ་བ་ནི་བཅུ་གཉིས་པའོ།
en: The twelfth is, “Lord, when there is no tathāgata, does the tathāgata’s magical creation do the work?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་སྤྲུལ་པ་དང་དེ་བཞིན་གཤེགས་པ་ལ་ཁྱད་པར་མ་མཆིས་ན་ཞེས་བྱ་བ་ནི་བཅུ་གསུམ་པའོ།
en: The thirteenth is, “Lord, if there is no distinction at all between a magical creation and a tathāgata, how will there be a pure gift?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་རྣམ་པར་དཀྲུག་པར་མི་བགྱི་བ་ལགས་ན་ཞེས་བྱ་བ་ནི་བཅུ་བཞི་པའོ།
en: The fourteenth is, “Lord, the true dharmic nature of all dharmas should not be made complicated, but has the Lord not complicated the true dharmic nature of all dharmas?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཞན་རྣམས་ཁོང་དུ་ཆུད་པར་བགྱི་བའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་མིང་དང་མཚན་མས་ཞེས་བྱ་བ་ནི་{བཅྭ་,བཅོ་}ལྔ་པའོ།
en: The fifteenth is, “Lord, if the Lord has taught the true dharmic nature of dharmas and explained dharmas with words and signs in order that others will comprehend, why, Lord, have you given an explanation in words and signs of dharmas that have no names and have no signs?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་བས་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་བཅུ་དྲུག་པའོ།
en: The sixteenth is, “Lord, if all dharmas finish as a mere name and sign, well then, for what do bodhisattva great beings produce the thought to be awakened?”

source: །བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་གསུང་ངམ་ཞེས་བྱ་བ་ནི་བཅུ་བདུན་པའོ།
en: The seventeenth is, “Lord, you say ‘knowledge of all aspects’ again and again?”

source: །བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདི་གསུམ་ཁྱད་ཅི་ཞིག་མཆིས་ཞེས་བྱ་བ་ནི་བཅོ་བརྒྱད་པའོ།
en: The eighteenth is, “Lord, what distinction is there between these three types of omniscience?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བགྱི་ཞེས་བྱ་བ་ནི་བཅུ་དགུ་པའོ།
en: The nineteenth is, “Lord, why does the knowledge of all aspects belong to tathāgatas?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བགྱི་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་པའོ།
en: The twentieth is, “Lord, why does the knowledge of path aspects belong to bodhisattva great beings?”

source: །ཅིའི་སླད་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བགྱི་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་གཅིག་པའོ།
en: The twenty-first is, “Why does all-knowledge belong to śrāvakas and pratyekabuddhas?”

source: །བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདི་གསུམ་ལས་འདིའི་སྤོང་བ་ནི་ལྷག་མ་དང་བཅས་པའོ། །འདིའི་སྤོང་བ་ནི་ལྷག་མ་མ་མཆིས་པའོ་ཞེས་བགྱི་བར་ཉོན་མོངས་པ་སྤོང་བ་ལ་ཐ་དད་དུ་བགྱི་བ་མ་མཆིས་སམ་ཞེས་བགྱི་བ་ནི་ཉི་ཤུ་གཉིས་པའོ།
en: The twenty-second is, “Lord, from among the three types of omniscience, is there a difference in the elimination of afflictions by them such that it is said, ‘with its abandonment there is something left over,’ but ‘with its abandonment there is nothing left over.’?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱིས་འདུས་མ་བགྱིས་མ་ཐོབ་པར་ཉོན་མོངས་པ་སྤངས་སམ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་གསུམ་པའོ།
en: The twenty-third is, “Lord, before these śrāvakas and pratyekabuddhas have reached the uncompounded, have they eliminated afflictions?”

source: །བཅོམ་ལྡན་འདས་འདུས་མ་བགྱིས་པ་ལ་བྱེ་བྲག་དམིགས་སུ་མ་མཆིས་སམ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བཞི་པའོ།
en: The twenty-fourth is, “Lord, are differences apprehended in the uncompounded?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དམིགས་སུ་མ་མཆིས་ན་ཅིའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་ལྔ་པའོ།
en: The twenty-fifth is, “Lord, if differences are not apprehended in the uncompounded, why does the Lord say, ‘This is an abandonment of residual impressions and connections.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལམ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་དྲུག་པའོ།
en: This is not an abandonment of residual impressions and connections?” The twenty-sixth is, “Lord, does a bodhisattva great being having stood on the path…?”

source: །སྐབས་འདིར་བར་སྐབས་སུ་ཞུས་པ་བཞིའོ།
en: In this part of the text, in a sub-section, there are four questions.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ལམ་ཡང་དངོས་པོ་མ་མཆིས་ལ་མྱ་ངན་ལས་འདས་པ་ཡང་དངོས་པོ་མ་མཆིས་ན་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བདུན་པའོ།
en: The twenty-seventh is, “Lord, if the path is not an existent thing and nirvāṇa is not an existent thing, why is it taught that ‘this is a stream enterer’?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་འདུས་མ་བགྱིས་པ་འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ་ཞེས་རབ་ཏུ་བྱེད་པ་ལགས་སོ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བརྒྱད་པའོ།
en: The twenty-eighth is, “Lord, does something uncompounded make the category ‘this is a stream enterer’?”

source: །བཅོམ་ལྡན་འདས་འཁོར་བའི་ཕྱི་མའི་མཐའ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་དགུ་པའོ།
en: The twenty-ninth is, “Lord, how will there be a later limit to saṃsāra?”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་ན་ཞེས་བྱ་བ་སུམ་ཅུ་པའོ།
en: The thirtieth is, “Lord, if in all phenomena empty of their own marks a prior limit is not apprehended, what need is there to say more about a later limit?”

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བགྱི་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གཅིག་པའོ།
en: The thirty-first is, “Lord, you say ‘perfection of wisdom’ again and again. Why, Lord, is it called ‘perfection of wisdom’?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དོན་དང་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གཉིས་པའོ།
en: The thirty-second is, “Lord, if a meaning and a method are not found in this perfection of wisdom, how can bodhisattva great beings practice this deep perfection of wisdom’s meaning?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་དོན་ཀྱང་མི་བགྱིད་དོན་མ་ལགས་པ་ཡང་མི་བགྱིད་ལགས་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གསུམ་པའོ།
en: The thirty-third is, “Lord, why does the perfection of wisdom not do good and not do bad?”

source: །བཅོམ་ལྡན་འདས་འོ་ན་འདུས་མ་བགྱིས། འཕགས་པ་ཐམས་ཅད་ཀྱི་དོན་མ་ལགས་སམ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བཞི་པའོ།
en: The thirty-fourth is, “But Lord, the uncompounded is good for all noble ones, is it not?”

source: །བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདུས་མ་བགྱིས་ཀྱི་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་ལྔ་པའོ།
en: The thirty-fifth is, “Lord, having trained in the uncompounded perfection of wisdom, do bodhisattva great beings not reach the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་གཉིས་སུ་མ་མཆིས་པའི་ཆོས་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་དྲུག་པའོ།
en: The thirty-sixth is, “Lord, does a nondual dharma…?”

source: །སྐབས་འདིར་བར་སྐབས་སུ་ཞུས་པ་གསུམ་པའོ།
en: In this part of the text, in a subsection, there are three questions.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བ་དེ་བསོད་ནམས་ཇི་ཙམ་ཞིག་བསྐྱེད་པར་འགྱུར་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བདུན་པའོ།
en: The thirty-seventh is, “Lord, how much merit do bodhisattva great beings make, who have produced the first thought, and who want to fully awaken to unsurpassed, perfect, complete awakening for the sake of all beings?”

source: །བཅོམ་ལྡན་འདས་སེམས་དང་པོ་བསྐྱེད་པས་ཅི་ཞིག་ཡིད་ལ་བགྱི་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བརྒྱད་པའོ།
en: The thirty-eighth is, “Lord, what should bodhisattva great beings who have produced the first thought pay attention to?”

source: །བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དམིགས་པ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་དགུ་པའོ།
en: The thirty-ninth is, “Lord, what is the objective support of the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབའ་ཞིག་དངོས་པོ་མ་མཆིས་པ་ལགས་སམ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་པའོ།
en: The fortieth is, “Lord, is only the knowledge of all aspects a nonexistent thing?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ངོ་བོ་ཉིད་མ་མཆིས་པ་ལགས་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གཅིག་པའོ།
en: The forty-first is, “Lord, why does the knowledge of all aspects have no intrinsic nature?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ན་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གཉིས་པའོ།
en: The forty-second is, “Lord, if all dharmas are the nonexistence of an intrinsic nature, with what skillful means do bodhisattva great beings, who have produced the first thought of awakening, practice the perfection of giving?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་རྣམས་ཆོས་ཉིད་དང་བྲལ་བ་ལགས་སམ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གསུམ་པའོ།
en: The forty-third is, “Lord, are phenomena separated from the phenomena themselves?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱང་གཞན་ཞིག་ལ་དོན་དམ་པ་ཡང་གཞན་ཞིག་ལགས་སམ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བཞི་པའོ།
en: The forty-fourth is, “Lord, is ordinary convention one thing and the ultimate another?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བགྱི་ན་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་ལྔ་པའོ།
en: The forty-fifth is, “Lord, you say ‘bodhisattva’s practice’ again and again, what are the words bodhisattva’s practice for?”

source: །བཅོམ་ལྡན་འདས་སངས་རྒྱས་སངས་རྒྱས་ཞེས་བགྱི་ན་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་དྲུག་པའོ།
en: The forty-sixth is, “Lord, you say ‘buddha’ again and again…?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་བྱང་ཆུབ་ཅེས་བགྱི་ན་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བདུན་པའོ།
en: The forty-seventh is, “Lord, you say ‘awakening’ again and again…?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བྱང་ཆུབ་འདི་ལ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བརྒྱད་པའོ།
en: The forty-eighth is, “Lord, if bodhisattva great beings who practice for this awakening practice the six perfections… what wholesome root of theirs will be accumulated or diminished, decreased or increased, produced or stopped, or defiled or purified?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་ཅེས་བྱ་བ་ནི་བཞི་བཅུ་དགུ་པའོ།
en: The forty-ninth is, “Lord, if the awakening of bodhisattva great beings practicing the perfection of wisdom is not available as any dharma in the manner of an objective support, how will bodhisattvas… fully grasp the perfection of giving?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཉིས་ཀྱི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་པའོ།
en: The fiftieth is, “If… in a dualistic way…?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་སླད་དུ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཅིག་པའོ།
en: The fifty-first is, “Lord, do bodhisattva great beings practice the perfection of wisdom for the sake of wholesome roots?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་མ་བགྱིས་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཉིས་པའོ།
en: The fifty-second is, “Lord, how do bodhisattva great beings who have attended on the lord buddhas… gain the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་རམ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གསུམ་པའོ།
en: The fifty-third is, “Lord, those bodhisattva great beings would not gain the knowledge of all aspects, would they?”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བགྱིས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བཞི་པའོ།
en: The fifty-fourth is, “Lord, why would even bodhisattva great beings who attend on the lord buddhas… not gain the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་ཐབས་མཁས་པ་གང་དང་ལྡན་པས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་ལྔ་པའོ།
en: The fifty-fifth is, “Lord, what are those skillful means, in possession of which bodhisattva great beings gain the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་དངོས་པོ་མ་མཆིས་པས་དངོས་པོ་མ་མཆིས་པར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བར་མི་ནུས་སམ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་དྲུག་པའོ།
en: The fifty-sixth is, “Lord, does a nonexistent thing fully awaken to a nonexistent thing?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྤྲོས་པ་གང་ལགས་ཞེས་བྱ་བ་ནི་ལྔ་བདུན་པའོ།
en: The fifty-seventh is, “Lord, what is the bodhisattva great beings’ thought construction?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་གང་ཡང་ངོ་བོ་ཉིད་དམིགས་སུ་མ་མཆིས་ན་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བརྒྱད་པའོ།
en: The fifty-eighth is, “Lord, if no phenomenon at all can be apprehended as having an intrinsic nature, on what path do bodhisattva great beings enter into the secure state of a bodhisattva?”
